/* author's solve: Veronika Nacheva
2. Нова Сграда
Автор: Вероника Начева
На СофтУни им предстои да се преместят в нова сграда, която да побере всички жадни  за знания студенти.
Вътрешните дизайнери обаче са изправени пред проблем, а именно оптимизиране на местата в новите зали.
Тъй като те не могат да се справят сами и са наясно, че студентите на СофтУни могат да им помогнат без затруднение, дизайнерите ви възлагат задачата.
По зададени размери (цяло число) трябва да изчислим и нарисуваме на конзолата колко места могат да се поберат в съответната зала, имайки предвид следното:
•	Седящите места трябва да са разположени по диагонал и означени с '#'.
•	Разстоянието между местата (празно място) се означава с '...'.
•	Чертежът на залата трябва да започне със седящо място в горният ляв ъгъл и да следва шаблона стол-празно място-стол-празно място.
•	Седящите места (столове) са разположени горе-дясно към долу-ляво.
•	За повече яснота вижте примерите по-долу.
Вход
•	Входът се прочита от конзолата.
•	Един ред – размера на залата – цяло число [3…151].
Изход
•	Изходът трябва да е чертеж на разположението на седящите и празни места в залата.
Ограничения
•	Позволено време: 0.100с
•	Позволена памет: 16.00мб
*/

function hallCalc(width) {
    let height = width / 2 + width
    for (let y = 0; y < height; y++) {
        let arr = []
        for (let x = 0; x < width; x++) {
            let isStripe = (x + y) % 4 === 0
            arr.push(isStripe ? "#" : ".")
        }
        console.log(arr.join(''))
    }
}

hallCalc(9)
// #...#...#
// ...#...#.
// ..#...#..
// .#...#...
// #...#...#
// ...#...#.
// ..#...#..
// .#...#...
// #...#...#
// ...#...#.
// ..#...#..
// .#...#...
// #...#...#
// ...#...#.
