// 4. Задължителна литература

// За лятната ваканция в списъка със задължителна литература на Жоро има определен брой книги, но Жоро
// предпочита да играе с приятели навън.
//
// Вашата задача е да помогнете на Жоро да изчисли колко часа на ден
// трябва да отделя, за да прочете необходимата литература, но и да прекарва максимално време навън.
//     Вход
// Функцията получава 3 аргумента:
//
// 1. Брой страници в текущата книга – цяло число в интервала [1…1000];
// 2. Страници, които може да прочита за 1 час – цяло число в интервала [1…1000];
// 3. Броя на дните, за които трябва да прочете книгата – цяло число в интервала [1…1000];
//
// Изход
// Да се отпечата на конзолата броят часове, които Жоро трябва да отделя за четене всеки ден.


function hoursNeededToReadBook(...args) {
    const totalPages = parseInt(args[0]);
    const pagesPerHour = parseInt(args[1]);
    const daysForReadingTheBook = parseInt(args[2]);
    let result = (totalPages / pagesPerHour) / daysForReadingTheBook;
    console.log(result);
}

hoursNeededToReadBook('432', '15', '4');